{"pages":[],"posts":[{"title":"2012年09月01日","text":"●25号，第一个登上月球的人类宇航员死于心脏手术并发症，当天吃晚饭的时候和表弟说起阿姆斯特朗去世，表弟第一反应就是“环法王自杀了？”，我回头想想，理解表弟，有多少人会在意这事件，60年代登上月球这样的事情显得离大家的生活那么遥远。曾经发明计算机、飞机这些高科技的人类，现在琢磨的却都是社交网络，仿佛忘记了用科技改造世界那样曾经金闪闪的梦想。 ●习惯性抬头看天空，尤其在傍晚坐在公交上时。夏天天空晴朗，即使是在白天，也能轻易在蓝色的天空上看到月球的身影，和夜晚一样漂亮；一天又一天，月亮由缺到圆，如此漂亮而又如此遥远；也许穷极一生，都只能遥远地看着这个几十万公里外、陪伴你一生的星球，那样的仿佛触手可及却又没法拉近多一点的距离。 ●在阳光明媚的白天，月球反射的太阳光和周围明亮的天空相比，并不会那样显眼，这让看到的人此时忘记了月亮这个词，它更像是作为遥远宇宙中的一个星球而存在，是月”球”，而不是月“亮”。 ●《球状闪电》里提过：在生活在地球上的人里面，十人里面有九人不知道月球是可以在白天看到的。即便是如此的明显，但也如此的让人忽视，不知真否。","link":"/2012/09/01/20120901/"},{"title":"疼痛&#x2F;性格&#x2F;传统&#x2F;《你一生的故事》&#x2F;预测","text":"疼痛科学家们发现，我们的身体无时无刻不在预测下一刻即将发生什么事情，并通过预测的结果调节我们的感知器官。我们都有过类似的经历：某一天在喝茶，剪指甲，挖鼻孔的时候无意发现到自己手上有一处割痕、伤口，然后会纳闷这伤口是怎么来的，怎么会一点感觉都没有；奇特的是，本来一点痛觉都没有的伤口，在你发现它之后，它瞬间像是发威变疼了。我们的大脑基于现有的身体状况，重新预测，并且告诉自己：“你应该觉得痛了”。 另一个经典的实验，把实验对象（被害者）的双手放在他们双眼看不到的地方，例如放在一个布袋里面，或者绑在他们背后。然后在他们面前放一个电视机，电视屏幕上播放的是一只正在被拍摄的手，研究者（施虐者）欺骗实验对象（被害者）称屏幕上这只手正是实验对象自己的手（实际上是一只别人的手，或者是橡胶制作的）。为了让实验对象信服，可以来一点温和的刺激：同时滴一滴水在电视屏幕拍到的那只手，与实验对象自己手上面，实验对象完全信以为电视屏幕上显示的正是自己的手了。接下来好玩的一幕就要上演了，当拿一根针去扎那只假手时，实验对象看到电视屏幕中的手被扎到，都露出疼痛的表情，声称自己真的被针扎到了，而且痛觉很真实（实际上他们的手在自己看不到的地方安全着呢）。 针扎手的实验结果非常的明显，实现对象的大脑误以为针要扎向自己的手，做出了不恰当的预测，调节自己手部的触觉感官神经，甚至误产生了痛觉。这声“痛”并非身体的本能反应，而是他的大脑告诉他：“你应该觉得痛”。 另：扎小人儿来报复仇人\\前男友妄想他会痛明显是无效的…… 性格我们经常说：某某人性格暴躁，一怎样就会生气；某某性格很友善，对人很好之类的断言。从另一个角度来讲，对一个人做所谓“性格“的评判，就是对这个人的行为作出预测。随着人与人之间的接触，我们会对另一个人的行事方式在自己脑中建立一套基本的模板，依据这个模板来预测他的行为。比如，我们觉得雷锋的“性格”是”乐于助人“，当提着一篮子水果从他身边走过，不小心把水果撒满一地时，依据“雷锋”的性格，我们会预测他会帮忙拾起来。当然，我们会有预测失误的时候：这个平常乐于助人的人不但没有捡起水果，还从满地水果中挑出一根香蕉拿走，大跨步哼着小曲走开…..于是我们会修改对这个人”性格“的评价，会改为”性格古怪“，预测他的行为就不能按老方法来了。 我们身边总会有被称为”性格复杂“的人，是不是因为预测他的行为总是失败？ 传统逢年过节，婚庆生日，送礼请客，如果有一个”传统“在，商家，统治阶级，各种参与者都可以更精确的预测即将发生的状况：群众们会吃什么，会上那玩，会送什么等等等等，然后制定相应的对策。传统到底某部分是不是为方便”预测“而生？另一个角度说就是降低不可预见性，大家预测得更容易，活得更轻松愉快。（某些陈旧的传统让人恼恶是另一回事） 《你一生的故事》如果人互相交流所采用的语言可以影响人的思维方式，比如说，一个英国人掌握了中文后，思维模式改变了；那《你一生的故事》把这个理论在某方那个面推向了极致：故事主人公学会了一门特别的外星语言，获得了预测未来的能力，预言到自己孩子在未来的死亡。如果这个世界遵循的规律是有因有果，基于现有收集到的信息而说出来的话语，必定也在默默的暗示这些“因”将在未来带来的“果”吧。 为什么我们现在用的语言一定要是这样子的呢，最简单的主谓宾结构，“我喜欢你”，可以有强调“喜欢”的描述形式，比如说成“喜欢我你”，“我”和“你”是“喜欢”的参与者。“我你”可以用来表达：我和你在一起。“我自己”，把“我”放在“自己”前面，即是我超越了自己。当智慧进化，语言可以参入更多复杂的信息，沙中窥世界。 生命的路上，我们都是预言者。","link":"/2012/11/27/%E3%80%8A%E4%BD%A0%E4%B8%80%E7%94%9F%E7%9A%84%E6%95%85%E4%BA%8B%E3%80%8B/"},{"title":"在东京逛家居","text":"近期去东京玩，体验了日式家居，逛了一些家居店 在东京逛家居1.无印良品 2.itoya有名的文具店 3.francfranc妹子风格的品牌。 4.IDEE色彩更浓郁些 5.秋叶原的友都八喜主要是家电 6.水景店日本的水景很出名，特地去了一家在ada水草造景大赛夺过奖的店铺参观，结果展品并不多。 7.旅馆在日本住宿，最让我印象深刻的是他们的整体卫浴，工厂定制，现场组装，模块化。虽然颜色单调了点，但十分好用，定制程度很高。 不过这样装需要空调装在外墙那边，日本房子较小，外墙较多，比较适用这种冷凝管设计。 8.日式民宿","link":"/2017/07/01/%E5%9C%A8%E4%B8%9C%E4%BA%AC%E9%80%9B%E5%AE%B6%E5%B1%85/"},{"title":"关于我","text":"E 性别：男爱好：游戏，摄影（都很废），偶尔画画游戏：《旷野之息》，《最后生还者》，《荒野大救赎》，《GTA 5》，《异度神剑2》，《三国志》11，《COD》现代战争，《最终幻想》，《神界 原罪》音乐：游戏BGM电影：《指环王》疾病：游戏阳痿症(缓解中)，拖延症(恶化中)，无玉玉症对于lgbtqiapkdjmhrfoenvcwsxz：中立态度","link":"/2000/01/01/%E5%85%B3%E4%BA%8E%E6%88%91/"},{"title":"成都","text":"","link":"/2020/09/21/%E6%88%90%E9%83%BD/"},{"title":"旋转楼梯思考","text":"爬楼梯很累，但，很多楼梯的旋转方式加剧了爬楼人的苦难。 楼梯旋转的方式简化来讲大约就是如下两种。 顺时针螺旋上升，和逆时针螺旋上升。(走左边上楼，走右边上楼) 在中国和美国，行人是靠右的，爬楼的也是行人，要遵守这条规定。 当楼道上有一定数量的人在走的时候，研究下人们的爬楼路线。 可以看到，在行人靠右的情况下，爬这种逆时针螺旋上升的楼梯，上楼的比下楼的要多走很远的路程！ 如果是这种旋转楼梯：就更明显了！ 如果全世界的人都爬一遍这个楼梯，上楼的人比下楼的多走的路程叠加起来肯定可以绕地球很多圈，远超多乐美奶茶。 上楼真的很辛苦，还要爬更远的路，虽说爬到二十层再下楼的时候走内圈路程稍微短点。 不幸的的事，我翻遍脑海，绝大多数的楼梯都是这种逆时针螺旋上升，除了高中学校。 所以，考虑到爬楼不易，建议，中国和美国的楼梯都改成下面这种。 另： 行人靠右的国家：中国，美国，俄罗斯 行人靠左的国家：英国，日本，泰国，澳大利亚wiki","link":"/2013/01/10/%E6%97%8B%E8%BD%AC%E6%A5%BC%E6%A2%AF%E6%80%9D%E8%80%83/"},{"title":"海南-大佛","text":"从成都飞到海南，与朋友环岛自驾了一圈","link":"/2020/09/24/%E6%B5%B7%E5%8D%97-%E5%A4%A7%E4%BD%9B/"},{"title":"艾尔登法环10小时游玩体验","text":"近期最火的游戏无疑是艾尔登环/老头环，在玩它之前，我有相当长的一段时间对游戏提不起兴趣，感谢老头环治好了我的病。网上有玩家评论此游戏是黑魂4，我是抱着对血缘诅咒的期待进入游戏的。 出山洞的那一刹，看见眼前的平原，非常有塞尔达旷野之息第一次见初始台地一般的感觉，但老头环的世界有着诡异光照的天空。出门眼前就是骑着马的大树守卫，一看就不好惹，果断的绕过。 游玩过程中，发现许多借鉴旷野之息的地方，例如无标注的大地图，通过某一处的地图碎片，绘制区域地图（对应塞尔达里的瞭望塔）。直接在地图上设置光柱，这一点老头环的操作要优于塞尔达，毕竟塞尔达还要拿望远镜，但是却也少了些许沉浸感。但塞尔达有详细的指引，老头环就只能自己看菜单按钮摸索了。 游戏的一大乐趣在于找小路绕过关卡或者进入城堡，第一个BOSS噩兆拦路的城堡，旁边有条小路可以绕过，自己发现的时候感觉有种做地下党的快感，然后趁势一路骑马跑到世界边缘，享受开地图的乐趣。 有无攻略游玩老头环，完全是两个不同的游戏体验…我认为，千万不要头铁自己摸索，过不去的机关，就查攻略吧。大平原地图空旷无比，游戏地图的精华在城堡与地下城。 关于逃课的争论，对我而言，在老头环里逃课是巨大的乐趣，甚至是玩游戏的动力。在知道了滚铁球刷经验大法之后，我和游戏群的基友立马上去刷了20级，一边说罪恶，一边真香。 玩了十多个小时，我认为老头环的地图引导，确实有很大的问题。几个流程关键路径：法师城的门，大升降梯的钥匙，都藏在很远的地方，或者完全无法直接关联起来的地点，不看攻略靠自己去找，很可能带来巨大挫败感。 关于法师，法师的岩石球法术，堪称逃课神器，利用施法动画的特性，可以在雾门外无伤消耗BOSS。另外法师在野外骑马，可以风筝非常多的野外BOSS，确实强。","link":"/2022/03/18/%E6%9C%80%E8%BF%91%E5%9C%A8%E7%8E%A9/"},{"title":"用画图工具修图","text":"Windows自带的小附件画图程序有很多实用的技巧，好用却鲜有人知道 强烈推荐windows xp版的画图，win7版的mspaint将一些菜单进行了整合，实际上降低了操作的效率 Ctrl键的使用1.调整笔刷大小 左侧的工具栏默认只提供3~4种笔刷大小可选，实际上mspaint笔刷大小可以通过使用快捷键 Ctrl 加 “+” 和 Ctrl 加 “-“ 来控制.线条的粗细也可以这样调节。 2.图像缩放这里所说的图像缩放不是视角的缩放，而是绘制的图形的放大与缩小，同样的可以通过快捷键 Ctrl 加 “+” 和 Ctrl 加 “-“ 快速的实现放大缩小。 Shift键的使用3.自定义笔刷mspaint也可以做到自定义笔刷，首先，绘制一个笔刷图案，其次用选框选择图案，注意是半透明模式。 笔刷的使用：最为关键之处，按住shift键不松，快速用鼠标拖动选区，简单又朴素的自定笔刷的效果就出来了。 通过控制笔刷形状和颜色，按shift键拖动可以绘制一些特别的效果：(关键之处在于图案的边界使用多种颜色组合) ##鼠标右键的使用 4.前景色与背景色 大部分人都知道在色板上使用鼠标左键选区颜色，设置前景色，或者使用工具栏里的吸管 同样的，选择颜色的时候用右键点击，而不是左键，就可以设置背景色。 自定背景色用处多多，最好用的就是用在笔刷上，用笔刷划线时，鼠标左键点击绘制使用的颜色是前景色，默认就是黑色，实际上，可以使用鼠标右键来点击绘制，这时使用的颜色就是背景色，这样，就等于拥有了可以划两种颜色的笔！对于要用鼠标作画的人来讲异常实用！ 5.颜色替换又是一个强大无比的功能。下图中的黑色网格掺杂了红色的杂色，想让网格变成纯黑色的网格，该怎么做呢，明显的使用油漆桶一个个色块的替换效率低下。 油漆桶可以实现某些颜色替换，但在下图中下部分，想要在左边灰色的圆里边随意涂上几笔红色而保持圆的外形就成了非常复杂的事。 这些情况，可以用到工具栏里面的橡皮擦，第一个网格，设置背景色为黑色，前景色为红色，再使用ctrl加+增大橡皮擦大小，然后按住右键不松，在半黑半红的网格上涂抹，注意是按住右键来涂抹，这样橡皮擦就只会擦除红色区域，而擦除过后的红色区域颜色变为了黑色(当前设置的背景色)，OK。 第二个灰色圆，前景色使用灰色，背景色使用红色，用橡皮擦右键使劲地涂抹把！:)","link":"/2012/08/11/%E7%94%A8%E7%94%BB%E5%9B%BE%E5%B7%A5%E5%85%B7%E4%BF%AE%E5%9B%BE/"},{"title":"用画图工具画曲线","text":"很多人会觉得画图里面那个曲线工具很诡异，简单写写我的心得 这就是传说中那个曲线工具 首先看一个曲线的例子： 红色使用曲线工具画出来的，其余蓝色和黑色的线只是辅助讲解用的，实际画曲线的时候它们只要存在于大脑中就行了。图中可以明显的看出，线段A-1和线段B-2是曲线的两根切线，也就是说，画一根曲线的时候，只需要确定曲线的两个端点的切线，曲线就会自动调整以适应这两根切线 (其实就是贝塞尔曲线)。 接下来看画图里面一根曲线到底要怎么画： 有一点与人们平常想法不同的地方，就是先有切线，再依切线生成的曲线XD，而不是先画个圆再在上面某点引出切线。有点像先有鸡蛋，再从这个鸡蛋推测是哪只鸡生下来的………….. 从上，有一点已经确定，那就是曲线的弯曲是与切线的方向有关的，那切线的长度会对曲线的生成有什么影响？看下图： 可以很明显的看出，切线的长度越大，可以理解为对被相切的曲线的约束力也就越大，曲线与这条切线也就离得更近。(其实是与该直线相切的圆的直径越大) 再看另一个例子 值得注意的是，曲线的起始点和结束点是很重要的，上面的例子中，如果把从A向B拉出一条线这一步骤改成从B向A拉出一条线，其余步骤不变，图像会有翻天覆地的变化，因为拉出线段确定切线的时候，第一次点击确定的是曲线起始点引出的切线。看图： 该曲线的切线实际上变成了： OK，至此基本上都说明完毕了，可以确定mspaint里面画曲线的几大要素：起始点，结束点，引导曲线的两根切线，切线的方向，切线的长度 随意再画几个实例： 接下来看看怎么样画椭圆等封闭的曲线： 关键在于，这些都是有两条曲线构成，而曲线圆滑的关键是两根曲线对应的两组切线要在同一条直线上。 于是乎，可以首先任意画两条直线，画曲线时再在其上取点。上面两个图的步骤： 0）画两根直线(这两根直线必须实际地画出来，不能单单在脑中想象….可以画完再用油漆桶擦掉) 1）从A点往B点拉出一条线 2）在点1处点击鼠标左键 3）再在点2处点击鼠标左键 4）从A点往B点拉出第二条线 5）在点3处点击鼠标左键 6）再在点4处点击鼠标左键 写了这么多，希望对这个有兴趣的人能看明白，也是为了防止自己一段时间不用全给忘了。","link":"/2010/12/17/%E7%94%A8%E7%94%BB%E5%9B%BE%E5%B7%A5%E5%85%B7%E7%94%BB%E6%9B%B2%E7%BA%BF/"},{"title":"绘","text":"","link":"/2012/11/18/%E7%BB%98/"},{"title":"读书笔记：时间管理","text":"1.在效率最高的时间点干活2.在碎片时间干活3.快速做决定，不优柔寡断，目的是节省时间4.条理，减少杂乱，包括电脑桌面，工作台，生活中的一切5.第一次见到任务就立即处理6.二八：80%的成效由20%的工作产生，找到并关注那20%7.关门，消除干扰，保持关注8.任务清单缓解焦虑（焦虑在于担心忘记事情）9.请教做过这件事（你将要做的事）的人10.一个任务，只花一定量的时间去做，不无尽的做下去 豆瓣：时间管理，作者: [美] 吉姆·兰德尔","link":"/2021/03/13/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0_%E6%97%B6%E9%97%B4%E7%AE%A1%E7%90%86/"},{"title":"重庆游记","text":"重庆游玩记录","link":"/2020/10/02/%E9%87%8D%E5%BA%86%E6%B8%B8%E8%AE%B0/"}],"tags":[{"name":"日常","slug":"日常","link":"/tags/%E6%97%A5%E5%B8%B8/"},{"name":"空想","slug":"空想","link":"/tags/%E7%A9%BA%E6%83%B3/"},{"name":"旅游","slug":"旅游","link":"/tags/%E6%97%85%E6%B8%B8/"},{"name":"家居","slug":"家居","link":"/tags/%E5%AE%B6%E5%B1%85/"},{"name":"摄影","slug":"摄影","link":"/tags/%E6%91%84%E5%BD%B1/"},{"name":"成都","slug":"成都","link":"/tags/%E6%88%90%E9%83%BD/"},{"name":"海南","slug":"海南","link":"/tags/%E6%B5%B7%E5%8D%97/"},{"name":"游戏","slug":"游戏","link":"/tags/%E6%B8%B8%E6%88%8F/"},{"name":"工具","slug":"工具","link":"/tags/%E5%B7%A5%E5%85%B7/"},{"name":"画画","slug":"画画","link":"/tags/%E7%94%BB%E7%94%BB/"},{"name":"读书","slug":"读书","link":"/tags/%E8%AF%BB%E4%B9%A6/"}],"categories":[{"name":"空想","slug":"空想","link":"/categories/%E7%A9%BA%E6%83%B3/"},{"name":"旅游","slug":"旅游","link":"/categories/%E6%97%85%E6%B8%B8/"},{"name":"游戏","slug":"游戏","link":"/categories/%E6%B8%B8%E6%88%8F/"},{"name":"工具","slug":"工具","link":"/categories/%E5%B7%A5%E5%85%B7/"},{"name":"画画","slug":"画画","link":"/categories/%E7%94%BB%E7%94%BB/"},{"name":"读书","slug":"读书","link":"/categories/%E8%AF%BB%E4%B9%A6/"}]}